<?PHP // $Id: my.php,v 1.2 2006/11/20 14:47:18 minkowski Exp $ 
      // my.php - created with Moodle 1.6 (2006050506)


$string['mymoodle'] = 'ภาพรวมของรายวิชาของฉัน';
$string['nocourses'] = 'ไม่มีข้อมูลของรายวิชาแสดง';
$string['noguest'] = 'บุคคลทั่วไปไม่สามารถเข้าถึงหน้าภาพรวมรายวิชาได้';
$string['pinblocks'] = 'ตั้งค่าบล็อคถาวรในมูเดิ้ลของฉัน';
$string['pinblocksexplan'] = 'การตั้งค่าใด ๆ เกี่ยวกับบล็อคในหน้านี้ ทุกคนที่ใช้งานเว็บไซต์นี้จะมองเห็นหน้าภาพรวมของ \"มูเดิ้ลของฉัน\" เหมือนกัน และไม่สามารถทำการแก้ไขได้';

?>
